Tekla Open API Reference for Tekla Structures 2025
Point.Equality Operator
 Compares the given two points for similarity.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator ==(
	Point p1,
	Point p2
)
Public Shared Operator = (
	p1 As Point,
	p2 As Point
) As Boolean
Parameters
p1
Type: Tekla.Structures.Geometry3d.Point
The first point to be used.
p2
Type: Tekla.Structures.Geometry3d.Point
The second point to be used.
Return Value
Type: Boolean
True if the given two points are similar. False otherwise.
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace